Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/powermgmt/powermgmt - Copy.c
/* Driver */
#include "r_cg_macrodriver.h"       /* CG Macro Driver */
#include "r_cg_cgc.h"           /* CG CGC Driver */
#include "r_cg_rtc.h"           /* CG RTC Driver */
#include "r_cg_sau.h"           /* CG Serial Driver */
#include "r_cg_dsadc.h"         /* CG DSADC Driver */
#include "r_cg_wdt.h"           /* CG WDT Driver */
#include "r_cg_lcd.h"           /* CG LCD Driver */
#include "r_cg_iica.h"          /* CG COMP Driver */
#include "r_cg_vbatt.h"         /* CG Backup Battery Driver */
#include "r_cg_lvd.h"           /* CG LVD Driver */
#include "r_cg_intp.h"          /* CG Interrupt Driver*/
#include "r_cg_adc.h"           /* CG 10bit ADC Driver */
#include "r_cg_dtc.h"           /* CG DTC Driver */
#include "emeter3_structs.h"

/* Wrapper/User */
#include "wrp_mcu.h"            /* Wrapper/MCU */
#include "wrp_em_sw_config.h"   /* SW configuration */
#include "wrp_em_adc.h"         /* Wrapper ADC */
#include "wrp_em_adc_data.h"
/* MW/Core */
#include "em_core.h"            /* EM Core APIs */

/* Application */
#include "platform.h"
#include "powermgmt.h"          /* Power Management Header File */
#include "r_lcd_display.h"      /* LCD display header file */
#include "em_display.h"         /* LCD parameter header file */
#include "event.h"              /* Event header file */
#include "key.h"                /* Key header file */
#include "startup.h"
#include "config_storage.h"    /* Configuration on chip */
#include "storage.h"            /* Storage header file */
#include "mlsCIApp.h"
#include "startup.h"            /* Start up header file */
#include "debug.h"
#include "e2rom.h"
#include "memoryOps.h"
#include "utilities.h"

#include "tampers.h"
#include "emeter3_app.h"
#include "pravakComm.h"

void update_energies_stored(void);


/******************************************************************************
Macro definitions
******************************************************************************/
/*
 * Define the RTC interval wakeup time for MODE3
 *  ONESEC : every 1s
 *  ONEMIN : every 60s (1minute)
 */
#define POWERMGMT_RTC_INTERVAL_WAKEUP_TIME      ONEMIN

#if ((POWERMGMT_RTC_INTERVAL_WAKEUP_TIME != ONESEC) && (POWERMGMT_RTC_INTERVAL_WAKEUP_TIME != ONEMIN))
    #error "POWERMGMT_RTC_INTERVAL_WAKEUP_TIME must be ONESEC or ONEMIN only"
#endif

/* Max counter to enter/release mode */
#define POWERMGMT_MAX_MODE1_COUNTER                 3000
#define POWERMGMT_MAX_MODE2_COUNTER                 5

typedef struct
{
    uint16_t is_rtc_int         :1;     // Flag to detect RTC wake up source 
    uint16_t is_cover_int       :1;     // Flag to detect COVER OPEN wake up source
    uint16_t is_key_int         :1;     // Flag to detect KEY press 
    uint16_t is_magnetic_int    :1;     // Flag to detect MAGNETIC sensor 
    uint16_t is_vbatt_low       :1;     // Flag to detect VBAT Voltage Low 
    uint16_t is_vrtc_low        :1;     // Flag to detect VRTC Voltage Low 
    uint16_t is_ac_low          :1;     // Flag to detect AC Power Low 
    uint16_t is_vdd_low         :1;     // Flag to detect AC Power Low 
    uint16_t is_neutral_missing :1;     // Flag to detect Neutral Missing 
} powermgmt_int_flag_t;

ext_rtc_t capturedRTC;
extern uint32_t calWatt;

/******************************************************************************
Imported global variables and functions (from other files)
******************************************************************************/

/******************************************************************************
Exported global variables and functions (to be accessed by other files)
******************************************************************************/

/******************************************************************************
Private global variables and functions
******************************************************************************/
#ifdef POWER_MANAGEMENT_ENABLE   

#ifndef __DEBUG
static
#endif
//powermgmt_mode_t        g_powermgmt_current_mode = POWERMGMT_MODE2;     /* Current mode value in mode diagram */
powermgmt_mode_t        g_powermgmt_current_mode = POWERMGMT_MODE1;     /* Current mode value in mode diagram */

#ifndef __DEBUG
static
#endif
//powermgmt_mode_t        g_powermgmt_previous_mode = POWERMGMT_MODE2;        /* Current mode value in mode diagram */
powermgmt_mode_t        g_powermgmt_previous_mode = POWERMGMT_MODE4;        /* Current mode value in mode diagram */


#ifndef __DEBUG
static
#endif
//powermgmt_mode_t        g_powermgmt_prev_main_mode = POWERMGMT_MODE1;       /* Current mode value in mode diagram */
powermgmt_mode_t        g_powermgmt_prev_main_mode = POWERMGMT_MODE1;       /* Current mode value in mode diagram */


#ifndef __DEBUG
//static
#endif

powermgmt_int_flag_t    g_powermgmt_flag = {0, 0, 0, 0, 0, 0, 0, 0};    /* Flag to control interrupt in powermgmt */

//static void POWERMGMT_DisplayLCDParams(float32_t kwh);
static uint8_t POWERMGMT_ProcessMode1(void);
static uint8_t POWERMGMT_ProcessMode2(void);
static uint8_t POWERMGMT_ProcessMode3(void);
static uint8_t POWERMGMT_ProcessMode3_Pseudo(void);
static uint8_t POWERMGMT_ProcessMode4(void);
static uint8_t POWERMGMT_ProcessMode5(void);
static uint8_t POWERMGMT_ProcessMode7(void);

static void POWERMGMT_DoAfterStop(void);
static void POWERMGMT_DoBeforeStop(void);
static void POWERMGMT_ACLow_Action(void);

void waitForSupplyToStabilize(void);


static void POWERMGMT_EXLVD_Action(void)
{
    if (g_powermgmt_flag.is_ac_low == 1)
    {
        EM_Stop();
        DSADCEN = 0U;                                   // DSAD module 
        ADCEN = 0U;                                     // ADC 10bit module 
        
// we should save kwh and critical data
//				update_energies_stored();
//  			write_alternately(CTLDATA_BASE_ADDRESS, ALTERNATE_CTLDATA_BASE_ADDRESS, (uint8_t*)&ctldata, sizeof(ctldata));
//        EVENT_PowerFail(EM_EXT_CALLBACK_STATE_ENTER);
        // Switch to lower clock 
        R_CGC_OperateAt6MHz();
    }
    else
    {// external vdd is back
        // AC High again, change to normal operation state, but ADCs still not start, wait until VDD is high again  
        // Switch to lower clock 
//				GDIDIS=0;	 // Enable inputs
				
//        EM_Stop();
        
