Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/powermgmt/powermgmt - Copy.c
        R_CGC_OperateAt24MHz();
        
//        EM_Start();
    }
}


static uint8_t POWERMGMT_ProcessMode3_Pseudo(void)
{
//	R_RTC_Set_ConstPeriodInterruptOn(PES_1_SEC);  /* Turn On one second interrupt to increment disp_timer */
  SAU0EN = 1U;                                    /* SAU0 module */
  SAU1EN = 1U;                                    /* SAU1 module */
  R_UART2_Start();                                /* Start UART2 */
	R_UART3_Start();
  return 0;
}

static void POWERMGMT_DoAfterStop(void)
{
	volatile uint8_t config_initial_status;
	
	
  SAU0EN = 1U;  
  SAU1EN = 1U; 
  R_UART0_Start(); 
  R_UART2_Start(); 
	R_UART3_Start();
	
	
	
// new code start		
		CSS=1;
		while (CLS!=1);	// wait
		
		DI();
		NOP();
		BUPPRT=1;
		VBATSEL=1;
		VBATSEL=0;
		BUPPRT=0;
		EI();
		
		waitForSupplyToStabilize();	// 500 microseconds at 32.768 KHz clock
		
		CSS=0;
		while (CLS!=0);
// CPU is now running on VDD and main system clock		
// new code end		


		POWERMGMT_EXLVD_Action();	// Switch to normal frequency - 24 MHz


//    IICA0EN = 1U;                                   /* IICA0 module */
    DSADCEN = 1U;                                   /* DSAD module */
    TAU0EN = 1U;                                    /* Timer module */
//    SAU0EN = 1U;                                    /* SAU0 module */
//    SAU1EN = 1U;                                    /* SAU1 module */
    ADCEN = 1U;                                     /* ADC 10bit module */
    MACEN = 1U;                                     /* MAC module */
    DTCEN = 1U;                                     /* DTC module */
    VRTCEN = 1U;
    
    R_PORT_Create();                                /* Reinitialize Pin Port */
    R_RTC_Set_ConstPeriodInterruptOn(PES_1_SEC);  /* Set RTC period interrupt */
//    R_RTC_Set_ClockOutputOn(RTCOS_FREQ_1HZ);        /* Set RTC output clock */
    R_TAU0_Channel0_Start();                            /* Stop TAU00 */    
    R_TAU0_Channel1_Start();                            /* Stop TAU00 */    
    R_TAU0_Channel2_Start();                            /* Stop TAU00 */    

		config_initial_status = CONFIG_Init();
    R_DSADC_SetChannelGain(EM_ADC_CURRENT_DRIVER_CHANNEL_PHASE_R, R_DSADC_GetGainEnumValue(EM_CALIB_DEFAULT_GAIN_PHASE_R));
    R_DSADC_SetChannelGain(EM_ADC_CURRENT_DRIVER_CHANNEL_PHASE_Y, R_DSADC_GetGainEnumValue(EM_CALIB_DEFAULT_GAIN_PHASE_Y));
    R_DSADC_SetChannelGain(EM_ADC_CURRENT_DRIVER_CHANNEL_PHASE_B, R_DSADC_GetGainEnumValue(EM_CALIB_DEFAULT_GAIN_PHASE_B));
    R_DSADC_SetChannelGain(EM_ADC_CURRENT_DRIVER_CHANNEL_NEUTRAL, R_DSADC_GetGainEnumValue(EM_CALIB_DEFAULT_GAIN_NEUTRAL));
    
    // Init default ADC Timer offset value  
    EM_ADC_SAMP_SetTimerOffset(EM_CALIB_DEFAULT_TIMER_OFFSET);

		R_TAU0_Channel3_Start();
		EM_Init((EM_PLATFORM_PROPERTY *)&g_EM_DefaultProperty,(EM_CONFIG *)&g_EM_DefaultConfig,(EM_CALIBRATION *)&g_EM_DefaultCalibration);
		config_data_load(config_initial_status);
		CONFIG_Restore(CONFIG_ITEM_CALIB);
		startEM();

//    R_UART0_Start();                                /* Start UART0 */
//    R_UART2_Start();                                /* Start UART2 */
//		R_UART3_Start();

//    R_INTC0_Start();
//    R_INTC1_Start();
//    R_IICA0_Start();                                /* Start IICA0 module */
    R_LCD_PowerOn();                                /* Start LCD */
//    R_INTC1_Start();
    
//		POWERMGMT_EXLVD_Action();	// Switch to normal frequency - 24 MHz

//		stopEM();
//		startEM();
}


void waitForSupplyToStabilize(void)
{// this function is called when we are running on sub-system clock 32.768KHz
// something no 17 NOPS should do the trick;

	NOP();
	NOP();
	NOP();
	NOP();
	NOP();
	NOP();
	NOP();
	NOP();
	NOP();
	NOP();
	NOP();
	NOP();
	NOP();
	NOP();
	NOP();
	NOP();
	NOP();

}

static void POWERMGMT_DoBeforeStop(void)
{
		POWERMGMT_EXLVD_Action();	// Switch to a lower frequency - 6 MHz
		
// The DI and EI statements enclosing the block of statements produce no change 
		
//		DI();
    LCD_ClearAll();
    R_LCD_PowerOff();                               /* Stop LCD module */
//    R_INTC0_Stop();
//    R_INTC1_Stop();
//    R_IICA0_Stop();                                 /* Stop IICA0 module */
    R_UART0_Stop();                                 /* Stop UART0 module */
    R_UART2_Stop();                                 /* Stop UART0 module */
    R_UART3_Stop();                                 /* Stop UART0 module */
    R_TAU0_Channel0_Stop();                         /* Stop TAU00 */
    R_TAU0_Channel1_Stop();                         /* Stop TAU01 */
    R_TAU0_Channel2_Stop();                         /* Stop TAU02 */
    R_TAU0_Channel3_Stop();                         /* Stop TAU03 */
//    R_RTC_Set_ConstPeriodInterruptOn(PES_2_SEC);  /* Set RTC period interrupt to 2 seconds in mode 4 */
    R_RTC_Set_ConstPeriodInterruptOff();            /* Change RTC to 1 sec interrupt and system */
    R_RTC_Set_ClockOutputOff();                     /* Disable RTC clock output */
    R_PORT_StopCreate();                            /* Reset pin port state */

    VRTCEN = 0U;	// no luck with this too.
		
//		GDIDIS = 1;
		
    /* Stop clock supply to all peripherals (except independent RTC) */
    PER0 = 0x00U;
    PER1 = 0x00U;
    PER2 = 0x00U;

// new code start		
		CSS=1;
		while (CLS!=1);	// wait

		DI();
		NOP();
		BUPPRT=1;
		VBATSEL=0;
		VBATSEL=1;
		BUPPRT=0;
		EI();
		
		waitForSupplyToStabilize();	// 500 microseconds at 32.768 KHz clock
		CSS=0;
		while (CLS!=0);
// CPU is now running on VBAT and main system clock		
// new code end	

//		EI();
}

static uint8_t POWERMGMT_ProcessMode1(void)
{
  timeinfo_t lastTime;  // minutes,hours,day,date,month,year - use this so that existing single phase incSurveyDate may be used.
	
//		POWERMGMT_ProcessMode3_Pseudo();	// This is written to simulate a mode3 before entering Mode 1
// To see the magic , if this will cause the communication to start working		
	
    POWERMGMT_DoAfterStop();

//		record_power_fail_event();	// both fail and return - shifted below		
	LCD_ClearAll();

	
// make a copy of ctldata time stamp
	if((capturedRTC.year==0)&&(capturedRTC.month==0)&&(capturedRTC.date==0)&&(capturedRTC.hour==0)&&(capturedRTC.minute==0))
	{
	  lastTime.minute=ctldata.minute;
	  lastTime.hour=ctldata.hour;
	  lastTime.date=ctldata.date;
	  lastTime.month=ctldata.month;
	  lastTime.year=ctldata.year;
	}
	else
	{
	  lastTime.minute=capturedRTC.minute;
	  lastTime.hour=capturedRTC.hour;
	  lastTime.date=capturedRTC.date;
	  lastTime.month=capturedRTC.month;
	  lastTime.year=capturedRTC.year;
	}

