Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/powermgmt/powermgmt - Copy.c
		readRTC();

		do_initial_things(); // required to be done upon return of power
		
//		init_done=1;	// shifted below

//		asendbare((uint8_t *)"Ent Mode 1\r\n");  		
		
		
    if (EM_GetSystemState() != SYSTEM_STATE_RUNNING)
    {
        if (EM_Start() != EM_OK)
        {
//            POWERMGMT_DisplayLCDError(1.01);
            return 1;   // resume fail
        }
    }

		
//  	LCD_DisplayDigit(1, 1);
		LCD_DisplayAll();
		
		if((lastTime.year==rtc.year)&&(lastTime.month==rtc.month)&&(lastTime.date==rtc.date))
		{
			if(((rtc.hour*60+rtc.minute)-(lastTime.hour*60+lastTime.minute))>=5)
				record_power_fail_event();	// both fail and return - shifted below		
		}
		else
		{// here date or month or year are different
			record_power_fail_event();	// both fail and return - shifted below		
		}
// it is possible that record_power_fail_event may return without writing the power return record
// if the EM has not returned voltage values
//		clear_tamperEvent_image(POWER_EVENT);	// record the power recovery tamper
		g_display_mode=0;	// autoscroll
		disp_state=0;
		disp_timer=disp_autoscroll_interval;		
		
		init_done=1;
		
    // Success 
    return 0;
}

static uint8_t POWERMGMT_ProcessMode2(void)
{
    // Clear interrupt flag
    if (g_powermgmt_flag.is_rtc_int == 1)       // RTC interrupt wakeup CPU
    {
        g_powermgmt_flag.is_rtc_int = 0;
    }
/*		
		if(g_powermgmt_previous_mode==POWERMGMT_MODE3)
		{
//        R_LCD_PowerOff();
        // Switch CPU back to fMAIN,
//        R_CGC_FclkUseFih();
		}
*/    
    return 0;
}


static uint8_t POWERMGMT_ProcessMode3(void)
{
//						P3|=0x80;	//E2ROM_SUPPLY_ON - This remains on - SCL, SDA and WP lines are made input
	R_RTC_Set_ConstPeriodInterruptOn(PES_1_SEC);  /* Turn On one second interrupt to increment disp_timer */
	P6 =0x05;	// WP=1,SDA=0,SCL=1
	PM6 = 0xFA;	// 1111 1010 - WP(Out), SDA(Inp), SCL(Out)
	
	R_LCD_PowerOn();

	g_display_mode=1;
	disp_state=0;
	disp_timer=disp_autoscroll_interval;
	

// This is to start the communication module	
  SAU0EN = 1U;                                    /* SAU0 module */
  SAU1EN = 1U;                                    /* SAU1 module */
	
// We must also Vcc2 (P57) On
	P5 |=0x80;	// P57=1 - 1000 0000
	
// TXD3(P85) must be output, RXD3(P84) input - already the case
// P85 must be 1
	P8|=0x20;	// 0010 0000 

// IRTXD(P56) must be output, IRRXD(P55) input - already the case
// P56 must be 1
	P5 |=0x40;	// P56=1 - 0100 0000
	
	
  R_UART2_Start();                                /* Start UART2 */
	R_UART3_Start();

// We can turn on AUX_OUT too to enable the other pushbuttons
	P5|=0x08;	// 0000 0100 - P5.3=1
	
	
  if (g_powermgmt_flag.is_cover_int == 1)
  {// log the cover open tamper - what happens to cover open tamper when power is there?
  	if((mytmprdata.tamperEvent_image&COVER_OPEN_MASK) == 0)
		{
			readRTC();
			mytmprdata.tamperEvent_flags |= COVER_OPEN_MASK;
			mytmprdata.tamperEvent_image |= COVER_OPEN_MASK;
			mytmprdata.tamperEvent_on|=COVER_OPEN_MASK;
			e2write_flags |= E2_W_EVENTDATA;
			wre2rom(); // write the tamper here itself
		}
		g_powermgmt_flag.is_cover_int=0;
	}
	
  return 0;
}

static uint8_t POWERMGMT_ProcessMode4(void)
{
	switch (g_powermgmt_previous_mode)
	{
    case POWERMGMT_MODE2:
// any pending memory operation must be completed before shutting down
			if(e2write_flags!=0)
			{
		  	wre2rom();
		    R_WDT_Restart();
				return 1;
			}

      if (EM_GetSystemState() == SYSTEM_STATE_RUNNING)
      {
        if (EM_Stop() == EM_OK)
        {
          // Do nothing
        }
        else
        {
          return 1;   // Stop EM Core fail
        }
			}

			readRTC();
			capturedRTC=rtc;
			
      // clear all the flag
      g_powermgmt_flag.is_rtc_int  = 0;
      g_powermgmt_flag.is_cover_int  = 0;
      g_powermgmt_flag.is_key_int  = 0;
      g_powermgmt_flag.is_magnetic_int = 0;
			
// clear the pulsing variables
			calWatt = 0;
			total_active_power=0;
			
			
			init_done=0;	// this must be done to prevent certain processing from taking place
//			asendbare((uint8_t *)"Xxx\r\n");  		
      POWERMGMT_DoBeforeStop(); // All peripherals off, system will go to STOP mode in polling processing
      return 0;	// Success
						
    case POWERMGMT_MODE3:
      // Stop LCD and IICA 
      R_LCD_PowerOff();
//		R_IICA0_Stop();
      IICA0EN = 0U;               // IICA0
      VRTCEN = 0U;
      R_PORT_StopCreate();
      return 0;	// Success
            
    // Not support previous mode
    case POWERMGMT_MODE1:
    case POWERMGMT_MODE5:
      return 1;
    }
    return 1; //we are not supposed to come here except in case of an error
}

static uint8_t POWERMGMT_ProcessMode5(void)
{
    POWERMGMT_DoAfterStop();
    
    if (EM_GetSystemState() != SYSTEM_STATE_RUNNING)
    {
        // Stop EM Core when it running
        if (EM_Start() != EM_OK)
        {
            return 1;
        }
    }

    return 0;
}

static uint8_t POWERMGMT_SwitchMode(powermgmt_mode_t newmode)
{
  uint8_t status = 0;

  // Process each mode 
  switch (newmode)
  {
    case POWERMGMT_MODE1: // Normal Mode
        status = POWERMGMT_ProcessMode1(); 
        break;
        
    case POWERMGMT_MODE2: // Transient Mode
      status = POWERMGMT_ProcessMode2(); 
      break;
        
    case POWERMGMT_MODE3:  //LCD and Cover Open During Sleep Mode
	    status = POWERMGMT_ProcessMode3();
	    break;
        
    case POWERMGMT_MODE4: // Sleep Mode
      status = POWERMGMT_ProcessMode4();
      break;
        
    case POWERMGMT_MODE5: // Neutral Missing Mode
      status = POWERMGMT_ProcessMode5(); 
      break;
        
    case POWERMGMT_MODE7:   // Debug mode
      status = 0;
      break;
        
    default:
      /* Failed */
      status = 1;
      break;              
  }
  return (status);
}
#endif      /* POWER_MANAGEMENT_ENABLE */

powermgmt_mode_t POWERMGMT_GetMode(void)
{
    #ifdef POWER_MANAGEMENT_ENABLE
        return g_powermgmt_current_mode;
    #else
        return POWERMGMT_MODE1;
    #endif
}

void POWERMGMT_PollingProcessing(void)
{// upon reset the current mode is mode2
  #ifdef POWER_MANAGEMENT_ENABLE
  static uint16_t mode1_counter = 0;
  static uint16_t mode2_counter = 0;
  
