Eppeltone-Engineers-Pvt-Ltd/Three-Phase-Base-MVVNL_Base-Code_010324_FOR_GUJRAT_UNI_47/Application/rl78i1c/application/powermgmt/powermgmt - Copy.c
  powermgmt_mode_t new_mode = g_powermgmt_current_mode;   
  g_powermgmt_previous_mode = g_powermgmt_current_mode;
	
	
  if (g_powermgmt_previous_mode != POWERMGMT_MODE2)
  {
      g_powermgmt_prev_main_mode = g_powermgmt_previous_mode;
  }
/*  
  if (g_powermgmt_flag.is_cover_int == 1)
  {// log the cover open tamper - what happens to cover open tamper when power is there?
	
  	if((mytmprdata.tamperEvent_image&COVER_OPEN_MASK) == 0)
		{
			readRTC();
			mytmprdata.tamperEvent_flags |= COVER_OPEN_MASK;
			mytmprdata.tamperEvent_image |= COVER_OPEN_MASK;
			mytmprdata.tamperEvent_on|=COVER_OPEN_MASK;
			e2write_flags |= E2_W_EVENTDATA;
			wre2rom(); // write the tamper here itself
		}
		g_powermgmt_flag.is_cover_int=0;
	}	
*/	
  switch (g_powermgmt_current_mode)
  {
    case POWERMGMT_MODE1:
			if(g_display_mode!=255)
			{
  			if(0!=e2write_flags)
					wre2rom();
				else
				{
		      if(g_powermgmt_flag.is_ac_low == 1)
		      {
	          new_mode = POWERMGMT_MODE2;
		      }
				}
			}
			
		  if (g_powermgmt_flag.is_cover_int == 1)
		  {// log the cover open tamper - what happens to cover open tamper when power is there?
		  	if((mytmprdata.tamperEvent_image&COVER_OPEN_MASK) == 0)
				{
					readRTC();
					mytmprdata.tamperEvent_flags |= COVER_OPEN_MASK;
					mytmprdata.tamperEvent_image |= COVER_OPEN_MASK;
					mytmprdata.tamperEvent_on|=COVER_OPEN_MASK;
					e2write_flags |= E2_W_EVENTDATA;
					wre2rom(); // write the tamper here itself
				}
				g_powermgmt_flag.is_cover_int=0;
			}	
      break;

    case POWERMGMT_MODE2:
      if (g_powermgmt_flag.is_ac_low == 0)
      {// external vdd is there
			
				mode1_counter++;
				if(mode1_counter>100)
				{
	        mode1_counter = 0;
	        new_mode = POWERMGMT_MODE1;
					g_display_mode=255;	// This is a flag to indicate that we are entering power mode 1
					disp_timer=disp_autoscroll_interval;
				}
      }
      else
      {// VDD pin has not yet gone to upper limit or VDD is falling
				//if (mode1_counter < POWERMGMT_MAX_MODE1_COUNTER)
        if (mode1_counter < 10)	// for testing - earlier 1000
        {// wait for some time - remain in mode 2
          mode1_counter++;
        }
        else
        {
          // if VDD pin is Below threshold --> Enter Power Fail Mode
          if (g_powermgmt_flag.is_ac_low == 1) 
          {// here external VDD has disappeared
            mode1_counter = 0;
            new_mode = POWERMGMT_MODE4; // sleep mode
          }
        }
      }
      break;
          
    case POWERMGMT_MODE3:
      if (g_powermgmt_flag.is_ac_low == 1)
      {// here there is no power and we are in mode three
				if((disp_state==10)&&(sleepCommMode==0))
				{
          new_mode = POWERMGMT_MODE2; // Transient Mode
				}
				
				if(g_powermgmt_flag.is_key_int==1)
				{
					disp_timer = disp_autoscroll_interval;
					g_powermgmt_flag.is_key_int=0;
				}
				
//				if(KEY1!=0)
				if(KEY1==0)
				{	
					if(disp_state>=2)
						disp_state=disp_state-2;
					disp_timer = disp_autoscroll_interval;
				}
      }
      else
      {
          mode1_counter = 0;
          new_mode = POWERMGMT_MODE2; 
      }
      break;

    case POWERMGMT_MODE4:
      if ( g_powermgmt_flag.is_ac_low == 0 ) 
      {// Switch to transition mode and log - ac power has returned
          new_mode = POWERMGMT_MODE2;
        mode1_counter = 0;
      }
			else if(g_powermgmt_flag.is_key_int==1)
			{// here switch has been pressed - new mode
				new_mode = POWERMGMT_MODE3;
				g_powermgmt_flag.is_key_int=0;
			}
			else if(g_powermgmt_flag.is_cover_int==1)
			{// here cover open switch has been operated
				new_mode = POWERMGMT_MODE3;
			}
			break;
          
    case POWERMGMT_MODE5: //neutral_missing
      new_mode = POWERMGMT_MODE2;
      break;
				
    case POWERMGMT_MODE7:
			mode1_counter = 0;
			new_mode = POWERMGMT_MODE2;
			break;
			
    default:
      new_mode = POWERMGMT_MODE1;
      break;
	}
    
    /* Change to new mode when need */
  if (new_mode != g_powermgmt_current_mode || new_mode == POWERMGMT_MODE2)
  {   
    if (POWERMGMT_SwitchMode(new_mode) == 0)
    {
        g_powermgmt_current_mode = new_mode;
    }
    else
    {// here there was an error in switching the mode
      /* TODO: Error */
    }
  }
    #endif  /* POWER_MANAGEMENT_ENABLE */
}

void POWERMGMT_RTC_InterruptCallback(void)
{
#ifdef POWER_MANAGEMENT_ENABLE
  g_powermgmt_flag.is_rtc_int = 1;
#endif    
}

void POWERMGMT_COVER_InterruptCallback(void)
{
#ifdef POWER_MANAGEMENT_ENABLE
  g_powermgmt_flag.is_cover_int = 1;
#endif
}

void POWERMGMT_KEY_InterruptCallback(void)
{
#ifdef POWER_MANAGEMENT_ENABLE
  g_powermgmt_flag.is_key_int = 1;
//  g_powermgmt_flag.is_key_int = 0;
#endif
}

void POWERMGMT_VDD_InterruptCallback(void)
{
#ifdef POWER_MANAGEMENT_ENABLE
// g_powermgmt_flag.is_vdd_low will not be used at all in online meter
  if(LVDVDDF == 0)    //VDD VOLTAGE > DETECTION THRESHOLD
  {// vdd is returning
    g_powermgmt_flag.is_vdd_low = 0;
  }
  else 
  {
    g_powermgmt_flag.is_vdd_low = 1;
//				set_tamperEvent_image(POWER_EVENT);	// record the power fail tamper
// power is failing - vdd going down
  }
#endif
}

void POWERMGMT_AC_InterruptCallback(void)
{// we are NOW using this interrupt - 24/Dec/2018 - meter has battery connected to DVDD 
#ifdef POWER_MANAGEMENT_ENABLE
    if(LVDEXLVDF == 0)    //EXLVD VOLTAGE > DETECTION THRESHOLD
    {
        g_powermgmt_flag.is_ac_low = 0;
    }
    else 
    {
        g_powermgmt_flag.is_ac_low = 1;
    }
#endif
}

void POWERMGMT_VBATT_InterruptCallback(void)
{
#ifdef POWER_MANAGEMENT_ENABLE
    if(LVDVBATF == 0)    //EXLVD VOLTAGE > DETECTION THRESHOLD
    {
        g_powermgmt_flag.is_vbatt_low = 0;
    }
    else 
    {
        g_powermgmt_flag.is_vbatt_low = 1;
    }
#endif
}

void POWERMGMT_VRTC_InterruptCallback(void)
{
#ifdef POWER_MANAGEMENT_ENABLE
    if(LVDVRTCF == 0)    //EXLVD VOLTAGE > DETECTION THRESHOLD
    {
        g_powermgmt_flag.is_vrtc_low = 0;
    }
    else 
    {
        g_powermgmt_flag.is_vrtc_low = 1;
    }
#endif
}

void POWERMGMT_NeutralMissing(EM_EXT_CALLBACK_STATE state)
{
#ifdef POWER_MANAGEMENT_ENABLE
    if (state == EM_EXT_CALLBACK_STATE_ENTER)
    {
        g_powermgmt_flag.is_neutral_missing = 1;
    }
    else
    {
        g_powermgmt_flag.is_neutral_missing = 0;
    }
#endif
}

void POWERMGMT_MAGNETIC_InterruptCallback(void)
{
#ifdef POWER_MANAGEMENT_ENABLE
    g_powermgmt_flag.is_magnetic_int = 1;
#endif
}

uint8_t POWERMGMT_IsACLow(void)
{
#ifdef POWER_MANAGEMENT_ENABLE
    return ((uint8_t)g_powermgmt_flag.is_ac_low);     /* return value of Monitor flag of comparator 0 */
#else
    return 0;
#endif
}

uint8_t POWERMGMT_IsVBATTLow(void)
{
#ifdef POWER_MANAGEMENT_ENABLE
    return ((uint8_t)g_powermgmt_flag.is_vbatt_low);     /* return value of Monitor flag of comparator 0 */
#else
    return 0;
#endif
}

uint8_t POWERMGMT_IsVRTCLow(void)
{   
#ifdef POWER_MANAGEMENT_ENABLE
    return ((uint8_t)g_powermgmt_flag.is_vrtc_low);     /* return value of Monitor flag of comparator 0 */
#else
    return 0;
#endif
}
